<a href="https://colab.research.google.com/github/jihami/MachineLearning_Inflean/blob/main/02%EA%B0%95_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4,5]) 
#시리즈:판다스에서 제공하는 데이터타입, 인덱스가 있는 1차원 배열, 논리형까지 모든 데이터타입 가능 
#왼쪽이 인덱스 오른쪽이 값

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
students_name = ["Curry", "Durant", "Ducan", "Green"]

In [9]:
math = [95, 35, 23, 85]

In [11]:
result = pd.DataFrame({
    "Name" : students_name,
    "Math" : math
}) #데이터 프레임 정의

In [12]:
result #이름, 수학점수를 묶은 데이터 프레임

     Name  Math
0   Curry    95
1  Durant    35
2   Ducan    23
3   Green    85